9/data/attachments/fd9248aa85b0fdb3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Adam_strong_Friend_89086_9</nif:username>
            <nif:friendToBeRequested>soap_friends_fd4d70fd-2839-401b-a404-14d329288601</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>